# importing the pandas

In [4]:
import pandas as pd;

# importing the csv file from local

In [6]:
df = pd.read_csv('aug_train.csv');

In [12]:
print(df.head());

   enrollee_id      city  city_development_index gender  \
0         8949  city_103                   0.920   Male
1        29725   city_40                   0.776   Male
2        11561   city_21                   0.624    NaN
3        33241  city_115                   0.789    NaN
4          666  city_162                   0.767   Male

       relevent_experience enrolled_university education_level  \
0  Has relevent experience       no_enrollment        Graduate
1   No relevent experience       no_enrollment        Graduate
2   No relevent experience    Full time course        Graduate
3   No relevent experience                 NaN        Graduate
4  Has relevent experience       no_enrollment         Masters

  major_discipline experience company_size    company_type last_new_job  \
0             STEM        >20          NaN             NaN            1
1             STEM         15        50-99         Pvt Ltd           >4
2             STEM          5          NaN             NaN        never
3  Business Degree         <1          NaN         Pvt Ltd        never
4             STEM        >20        50-99  Funded Startup            4

   training_hours  target
0              36     1.0
1              47     0.0
2              83     0.0
3              52     1.0
4               8     0.0

In [16]:
print(df.ndim);

2

In [20]:
print(df.shape);
# this means it has 19158 rows and 14 columns

(19158, 14)

# reading csv file from any url Kind of the APi things

In [30]:
import requests ; # it is like axios in the javascript

In [32]:
from io import StringIO ;

In [40]:
# the url on which we will adding the get requests ;
url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv" ;

In [42]:
# header have necessary data for calling a server 
headers = {"User-Agent": "Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:66.0) Gecko/20100101 Firefox/66.0"}

In [77]:
# making a request on the url servers but data is basically in the unreadable form to make it readable we need to do converstion
req = requests.get(url,headers = headers);
print(req)  ;
# we get response object which is inreadable

<Response [200]>

In [79]:
# from the request we are taking out text 
data = StringIO(req.text); # while working with csv we need to keep in mind to do it text only

In [81]:
print(data);

<_io.StringIO object at 0x0000019E9A2F0DC0>

In [83]:
actualDataFromServer = pd.read_csv(data) ;

In [85]:
print(actualDataFromServer);

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]

# sep parametres when we read csv by default it separates on the values of the comma , but with tab separated files we might end up getting wrong val so we need to use the separator

In [105]:
tsvData = pd.read_csv('movie_titles_metadata.tsv',sep = '\t',names = ['S No.','Movie','Release Year','Ratings','Votes','geners']); # here the \t means separate the data on the basis of the tab so we will get the actual 
# data here But by deafault it takes the first row as the column so we have a names parametre where we can pass an array of the column name

In [107]:
print(tsvData);

    S No.                       Movie Release Year  Ratings     Votes  \
0      m0  10 things i hate about you         1999      6.9   62847.0
1      m1  1492: conquest of paradise         1992      6.2   10421.0
2      m2                  15 minutes         2001      6.1   25854.0
3      m3       2001: a space odyssey         1968      8.4  163227.0
4      m4                     48 hrs.         1982      6.9   22289.0
..    ...                         ...          ...      ...       ...
612  m612                    watchmen         2009      7.8  135229.0
613  m613                         xxx         2002      5.6   53505.0
614  m614                       x-men         2000      7.4  122149.0
615  m615          young frankenstein         1974      8.0   57618.0
616  m616                   zulu dawn         1979      6.4    1911.0

                                                geners
0                                 ['comedy' 'romance']
1          ['adventure' 'biography' 'drama' 'history']
2                ['action' 'crime' 'drama' 'thriller']
3                     ['adventure' 'mystery' 'sci-fi']
4       ['action' 'comedy' 'crime' 'drama' 'thriller']
..                                                 ...
612  ['action' 'crime' 'fantasy' 'mystery' 'sci-fi'...
613                     ['action' 'adventure' 'crime']
614                                ['action' 'sci-fi']
615                                ['comedy' 'sci-fi']
616     ['action' 'adventure' 'drama' 'history' 'war']

[617 rows x 6 columns]

# index_col parameter if we a column to become the index instead of the default index then we can go with index_col the index_col that we have given will become the index

In [114]:

df = pd.read_csv('aug_train.csv',index_col = 'enrollee_id');

print(df.head());

                 city  city_development_index gender      relevent_experience  \
enrollee_id
8949         city_103                   0.920   Male  Has relevent experience
29725         city_40                   0.776   Male   No relevent experience
11561         city_21                   0.624    NaN   No relevent experience
33241        city_115                   0.789    NaN   No relevent experience
666          city_162                   0.767   Male  Has relevent experience

            enrolled_university education_level major_discipline experience  \
enrollee_id
8949              no_enrollment        Graduate             STEM        >20
29725             no_enrollment        Graduate             STEM         15
11561          Full time course        Graduate             STEM          5
33241                       NaN        Graduate  Business Degree         <1
666               no_enrollment         Masters             STEM        >20

            company_size    company_type last_new_job  training_hours  target
enrollee_id
8949                 NaN             NaN            1              36     1.0
29725              50-99         Pvt Ltd           >4              47     0.0
11561                NaN             NaN        never              83     0.0
33241                NaN         Pvt Ltd        never              52     1.0
666                50-99  Funded Startup            4               8     0.0

# header parameter if we have a columns named as the row we can simply do header = 1 
## it tells us from where the actual row data starts

In [131]:
testDataFrame = pd.read_csv('test.csv',header=1, index_col = 0);
print(testDataFrame);

   enrollee_id      city  city_development_index gender  \
0
1        29725   city_40                   0.776   Male
2        11561   city_21                   0.624    NaN
3        33241  city_115                   0.789    NaN
4          666  city_162                   0.767   Male

       relevent_experience enrolled_university education_level  \
0
1   No relevent experience       no_enrollment        Graduate
2   No relevent experience    Full time course        Graduate
3   No relevent experience                 NaN        Graduate
4  Has relevent experience       no_enrollment         Masters

  major_discipline experience company_size    company_type last_new_job  \
0
1             STEM         15        50-99         Pvt Ltd           >4
2             STEM          5          NaN             NaN        never
3  Business Degree         <1          NaN         Pvt Ltd        never
4             STEM        >20        50-99  Funded Startup            4

   training_hours  target
0
1              47       0
2              83       0
3              52       1
4               8       0

# use_col while importing the data it might possible that all the data might not be required so we can do use cols

In [139]:
# use call params takes the list of the columns that we require
useColDataFrame = pd.read_csv('aug_train.csv',usecols = ['enrollee_id','gender','education_level']); # so we will be having only this three data
print(useColDataFrame);

       enrollee_id gender education_level
0             8949   Male        Graduate
1            29725   Male        Graduate
2            11561    NaN        Graduate
3            33241    NaN        Graduate
4              666   Male         Masters
...            ...    ...             ...
19153         7386   Male        Graduate
19154        31398   Male        Graduate
19155        24576   Male        Graduate
19156         5756   Male     High School
19157        23834    NaN  Primary School

[19158 rows x 3 columns]

# squeze param it is use to convert the data frame into a series

In [152]:
useSquezeData = pd.read_csv('aug_train.csv',usecols = ['gender'])['gender'];

In [154]:
print(useSquezeData);

0        Male
1        Male
2         NaN
3         NaN
4        Male
         ...
19153    Male
19154    Male
19155    Male
19156    Male
19157     NaN
Name: gender, Length: 19158, dtype: object

# skipping row

In [165]:
# if I am working with certain data and I want to skipp any row we can simply do
useSkippData = pd.read_csv('aug_train.csv',skiprows = [0,2]) ;
print(useSkippData);

        8949  city_103   0.92  Male  Has relevent experience  \
0      11561   city_21  0.624   NaN   No relevent experience
1      33241  city_115  0.789   NaN   No relevent experience
2        666  city_162  0.767  Male  Has relevent experience
3      21651  city_176  0.764   NaN  Has relevent experience
4      28806  city_160  0.920  Male  Has relevent experience
...      ...       ...    ...   ...                      ...
19151   7386  city_173  0.878  Male   No relevent experience
19152  31398  city_103  0.920  Male  Has relevent experience
19153  24576  city_103  0.920  Male  Has relevent experience
19154   5756   city_65  0.802  Male  Has relevent experience
19155  23834   city_67  0.855   NaN   No relevent experience

          no_enrollment        Graduate             STEM  >20 Unnamed: 9  \
0      Full time course        Graduate             STEM    5        NaN
1                   NaN        Graduate  Business Degree   <1        NaN
2         no_enrollment         Masters             STEM  >20      50-99
3      Part time course        Graduate             STEM   11        NaN
4         no_enrollment     High School              NaN    5      50-99
...                 ...             ...              ...  ...        ...
19151     no_enrollment        Graduate       Humanities   14        NaN
19152     no_enrollment        Graduate             STEM   14        NaN
19153     no_enrollment        Graduate             STEM  >20      50-99
19154     no_enrollment     High School              NaN   <1    500-999
19155     no_enrollment  Primary School              NaN    2        NaN

          Unnamed: 10      1   36  1.0
0                 NaN  never   83  0.0
1             Pvt Ltd  never   52  1.0
2      Funded Startup      4    8  0.0
3                 NaN      1   24  1.0
4      Funded Startup      1   24  0.0
...               ...    ...  ...  ...
19151             NaN      1   42  1.0
19152             NaN      4   52  1.0
19153         Pvt Ltd      4   44  0.0
19154         Pvt Ltd      2   97  0.0
19155             NaN      1  127  0.0

[19156 rows x 14 columns]

# nrows it will give us only the necessary rows

In [168]:
print(pd.read_csv('aug_train.csv',nrows = 100)); # it will give only first 100 rows

    enrollee_id      city  city_development_index gender  \
0          8949  city_103                   0.920   Male
1         29725   city_40                   0.776   Male
2         11561   city_21                   0.624    NaN
3         33241  city_115                   0.789    NaN
4           666  city_162                   0.767   Male
..          ...       ...                     ...    ...
95        12081   city_65                   0.802   Male
96         7364  city_160                   0.920    NaN
97        11184   city_74                   0.579    NaN
98         7016   city_65                   0.802   Male
99         8695   city_11                   0.550   Male

        relevent_experience enrolled_university education_level  \
0   Has relevent experience       no_enrollment        Graduate
1    No relevent experience       no_enrollment        Graduate
2    No relevent experience    Full time course        Graduate
3    No relevent experience                 NaN        Graduate
4   Has relevent experience       no_enrollment         Masters
..                      ...                 ...             ...
95  Has relevent experience    Full time course        Graduate
96   No relevent experience    Full time course     High School
97   No relevent experience    Full time course        Graduate
98  Has relevent experience       no_enrollment        Graduate
99  Has relevent experience       no_enrollment        Graduate

   major_discipline experience company_size    company_type last_new_job  \
0              STEM        >20          NaN             NaN            1
1              STEM         15        50-99         Pvt Ltd           >4
2              STEM          5          NaN             NaN        never
3   Business Degree         <1          NaN         Pvt Ltd        never
4              STEM        >20        50-99  Funded Startup            4
..              ...        ...          ...             ...          ...
95             STEM          9        50-99         Pvt Ltd            1
96              NaN          2      100-500         Pvt Ltd            1
97             STEM          2      100-500         Pvt Ltd            1
98             STEM          6        50-99         Pvt Ltd            2
99             STEM          6        10/49         Pvt Ltd            2

    training_hours  target
0               36     1.0
1               47     0.0
2               83     0.0
3               52     1.0
4                8     0.0
..             ...     ...
95              33     0.0
96             142     0.0
97              34     0.0
98              14     1.0
99              27     1.0

[100 rows x 14 columns]

# encoding 
## some times the data set might not be encoded with ut-f for that we have two options either to go to the editors and convert it or give it the the utf format it has

In [181]:
zomatoData = pd.read_csv('zomato.csv',encoding = 'latin-1');

In [183]:
print(zomatoData);

      Restaurant ID           Restaurant Name  Country Code              City  \
0           6317637          Le Petit Souffle           162       Makati City
1           6304287          Izakaya Kikufuji           162       Makati City
2           6300002    Heat - Edsa Shangri-La           162  Mandaluyong City
3           6318506                      Ooma           162  Mandaluyong City
4           6314302               Sambo Kojin           162  Mandaluyong City
...             ...                       ...           ...               ...
9546        5915730              NamlÛ± Gurme           208         ÛÁstanbul
9547        5908749             Ceviz AÛôacÛ±           208         ÛÁstanbul
9548        5915807                     Huqqa           208         ÛÁstanbul
9549        5916112              Aôôk Kahve           208         ÛÁstanbul
9550        5927402  Walter's Coffee Roastery           208         ÛÁstanbul

                                                Address  \
0     Third Floor, Century City Mall, Kalayaan Avenu...
1     Little Tokyo, 2277 Chino Roces Avenue, Legaspi...
2     Edsa Shangri-La, 1 Garden Way, Ortigas, Mandal...
3     Third Floor, Mega Fashion Hall, SM Megamall, O...
4     Third Floor, Mega Atrium, SM Megamall, Ortigas...
...                                                 ...
9546  Kemankeô Karamustafa Paôa Mahallesi, RÛ±htÛ±...
9547  Koôuyolu Mahallesi, Muhittin íìstí_ndaÛô Cadd...
9548  Kuruí_eôme Mahallesi, Muallim Naci Caddesi, N...
9549  Kuruí_eôme Mahallesi, Muallim Naci Caddesi, N...
9550  CafeaÛôa Mahallesi, BademaltÛ± Sokak, No 21/B,...

                                        Locality  \
0      Century City Mall, Poblacion, Makati City
1     Little Tokyo, Legaspi Village, Makati City
2     Edsa Shangri-La, Ortigas, Mandaluyong City
3         SM Megamall, Ortigas, Mandaluyong City
4         SM Megamall, Ortigas, Mandaluyong City
...                                          ...
9546                                    Karakí_y
9547                                   Koôuyolu
9548                                 Kuruí_eôme
9549                                 Kuruí_eôme
9550                                        Moda

                                       Locality Verbose   Longitude  \
0     Century City Mall, Poblacion, Makati City, Mak...  121.027535
1     Little Tokyo, Legaspi Village, Makati City, Ma...  121.014101
2     Edsa Shangri-La, Ortigas, Mandaluyong City, Ma...  121.056831
3     SM Megamall, Ortigas, Mandaluyong City, Mandal...  121.056475
4     SM Megamall, Ortigas, Mandaluyong City, Mandal...  121.057508
...                                                 ...         ...
9546                                Karakí_y, ÛÁstanbul   28.977392
9547                               Koôuyolu, ÛÁstanbul   29.041297
9548                             Kuruí_eôme, ÛÁstanbul   29.034640
9549                             Kuruí_eôme, ÛÁstanbul   29.036019
9550                                    Moda, ÛÁstanbul   29.026016

       Latitude                          Cuisines  ...          Currency  \
0     14.565443        French, Japanese, Desserts  ...  Botswana Pula(P)
1     14.553708                          Japanese  ...  Botswana Pula(P)
2     14.581404  Seafood, Asian, Filipino, Indian  ...  Botswana Pula(P)
3     14.585318                   Japanese, Sushi  ...  Botswana Pula(P)
4     14.584450                  Japanese, Korean  ...  Botswana Pula(P)
...         ...                               ...  ...               ...
9546  41.022793                           Turkish  ...  Turkish Lira(TL)
9547  41.009847   World Cuisine, Patisserie, Cafe  ...  Turkish Lira(TL)
9548  41.055817            Italian, World Cuisine  ...  Turkish Lira(TL)
9549  41.057979                   Restaurant Cafe  ...  Turkish Lira(TL)
9550  40.984776                              Cafe  ...  Turkish Lira(TL)

     Has Table booking Has Online delivery Is delivering now  \
0                  Yes                  No                No
1                  Yes                  No                No
2                  Yes                  No                No
3                   No                  No                No
4                  Yes                  No                No
...                ...                 ...               ...
9546                No                  No                No
9547                No                  No                No
9548                No                  No                No
9549                No                  No                No
9550                No                  No                No

     Switch to order menu Price range  Aggregate rating  Rating color  \
0                      No           3               4.8    Dark Green
1                      No           3               4.5    Dark Green
2                      No           4               4.4         Green
3                      No           4               4.9    Dark Green
4                      No           4               4.8    Dark Green
...                   ...         ...               ...           ...
9546                   No           3               4.1         Green
9547                   No           3               4.2         Green
9548                   No           4               3.7        Yellow
9549                   No           4               4.0         Green
9550                   No           2               4.0         Green

     Rating text Votes
0      Excellent   314
1      Excellent   591
2      Very Good   270
3      Excellent   365
4      Excellent   229
...          ...   ...
9546   Very Good   788
9547   Very Good  1034
9548        Good   661
9549   Very Good   901
9550   Very Good   591

[9551 rows x 21 columns]

# skip bad lines
## It might be possible that the data might normally contain 6 lines suddenly have 8 lines it might cause error so we need to skip the lines

In [190]:
# if we get parser error there might be possibilty that we will be getting parser error it might throw error
error_bad_lines =  false ;

NameError: name 'false' is not defined

# dtpye param there might be possibility that for boolean we might have been taking a lot of data it might cause an error
## so we can change it

In [204]:
augData = pd.read_csv('aug_train.csv',dtype = {'target':int  });
print(augData);
#here we have a column named target which have only values 0 and 1 and it is taking a float data type 
#we can store in boolean or integer* we need give a dictionary to target

       enrollee_id      city  city_development_index gender  \
0             8949  city_103                   0.920   Male
1            29725   city_40                   0.776   Male
2            11561   city_21                   0.624    NaN
3            33241  city_115                   0.789    NaN
4              666  city_162                   0.767   Male
...            ...       ...                     ...    ...
19153         7386  city_173                   0.878   Male
19154        31398  city_103                   0.920   Male
19155        24576  city_103                   0.920   Male
19156         5756   city_65                   0.802   Male
19157        23834   city_67                   0.855    NaN

           relevent_experience enrolled_university education_level  \
0      Has relevent experience       no_enrollment        Graduate
1       No relevent experience       no_enrollment        Graduate
2       No relevent experience    Full time course        Graduate
3       No relevent experience                 NaN        Graduate
4      Has relevent experience       no_enrollment         Masters
...                        ...                 ...             ...
19153   No relevent experience       no_enrollment        Graduate
19154  Has relevent experience       no_enrollment        Graduate
19155  Has relevent experience       no_enrollment        Graduate
19156  Has relevent experience       no_enrollment     High School
19157   No relevent experience       no_enrollment  Primary School

      major_discipline experience company_size    company_type last_new_job  \
0                 STEM        >20          NaN             NaN            1
1                 STEM         15        50-99         Pvt Ltd           >4
2                 STEM          5          NaN             NaN        never
3      Business Degree         <1          NaN         Pvt Ltd        never
4                 STEM        >20        50-99  Funded Startup            4
...                ...        ...          ...             ...          ...
19153       Humanities         14          NaN             NaN            1
19154             STEM         14          NaN             NaN            4
19155             STEM        >20        50-99         Pvt Ltd            4
19156              NaN         <1      500-999         Pvt Ltd            2
19157              NaN          2          NaN             NaN            1

       training_hours  target
0                  36       1
1                  47       0
2                  83       0
3                  52       1
4                   8       0
...               ...     ...
19153              42       1
19154              52       1
19155              44       0
19156              97       0
19157             127       0

[19158 rows x 14 columns]

# handling dates 
## when we parse a csv file it dates gets parsed into integer and we cannot use the data / time functions on it

In [219]:
iplData = pd.read_csv('IPL Matches 2008-2020.csv',parse_dates = ['date']).head();
#here we are parsing the dates so for that we have parse_date attributes and we need to pall list of items
print(iplData);

       id        city       date player_of_match  \
0  335982   Bangalore 2008-04-18     BB McCullum
1  335983  Chandigarh 2008-04-19      MEK Hussey
2  335984       Delhi 2008-04-19     MF Maharoof
3  335985      Mumbai 2008-04-20      MV Boucher
4  335986     Kolkata 2008-04-20       DJ Hussey

                                        venue  neutral_venue  \
0                       M Chinnaswamy Stadium              0
1  Punjab Cricket Association Stadium, Mohali              0
2                            Feroz Shah Kotla              0
3                            Wankhede Stadium              0
4                                Eden Gardens              0

                         team1                        team2  \
0  Royal Challengers Bangalore        Kolkata Knight Riders
1              Kings XI Punjab          Chennai Super Kings
2             Delhi Daredevils             Rajasthan Royals
3               Mumbai Indians  Royal Challengers Bangalore
4        Kolkata Knight Riders              Deccan Chargers

                   toss_winner toss_decision                       winner  \
0  Royal Challengers Bangalore         field        Kolkata Knight Riders
1          Chennai Super Kings           bat          Chennai Super Kings
2             Rajasthan Royals           bat             Delhi Daredevils
3               Mumbai Indians           bat  Royal Challengers Bangalore
4              Deccan Chargers           bat        Kolkata Knight Riders

    result  result_margin eliminator method    umpire1         umpire2
0     runs          140.0          N    NaN  Asad Rauf     RE Koertzen
1     runs           33.0          N    NaN  MR Benson      SL Shastri
2  wickets            9.0          N    NaN  Aleem Dar  GA Pratapkumar
3  wickets            5.0          N    NaN   SJ Davis       DJ Harper
4  wickets            5.0          N    NaN  BF Bowden     K Hariharan

# covertors 
## it want to covert something like royal challengers banglore with RCB and SOON we can use covertors we need pass a dictionary of the convertors and on what basis it shoulb be coverted

In [235]:
def getTeamAcronyms(teamName):
    if teamName == 'Royal Challengers Bangalore':
        return 'RCB'
    elif teamName == 'Chennai Super Kings':
        return 'CSK'
    elif teamName == 'Rajasthan Royals':
        return 'RR'
    elif teamName == 'Mumbai Indians':
        return 'MI' 
    elif teamName == 'Deccan Chargers':
        return 'DC'
    elif teamName == 'Kings XI Punjab':
        return 'KXIP'
    elif teamName == 'Delhi Daredevils':
        return 'DC'
    else :
        return 'KKR' ;

In [239]:
print(getTeamAcronyms('Deccan Chargers'));

DC

In [249]:
iplData = pd.read_csv('IPL Matches 2008-2020.csv',converters = {'team1':getTeamAcronyms,'team2':getTeamAcronyms});
print(iplData);

          id        city        date player_of_match  \
0     335982   Bangalore  2008-04-18     BB McCullum
1     335983  Chandigarh  2008-04-19      MEK Hussey
2     335984       Delhi  2008-04-19     MF Maharoof
3     335985      Mumbai  2008-04-20      MV Boucher
4     335986     Kolkata  2008-04-20       DJ Hussey
..       ...         ...         ...             ...
811  1216547       Dubai  2020-09-28  AB de Villiers
812  1237177       Dubai  2020-11-05       JJ Bumrah
813  1237178   Abu Dhabi  2020-11-06   KS Williamson
814  1237180   Abu Dhabi  2020-11-08      MP Stoinis
815  1237181       Dubai  2020-11-10        TA Boult

                                          venue  neutral_venue team1 team2  \
0                         M Chinnaswamy Stadium              0   RCB   KKR
1    Punjab Cricket Association Stadium, Mohali              0  KXIP   CSK
2                              Feroz Shah Kotla              0    DC    RR
3                              Wankhede Stadium              0    MI   RCB
4                                  Eden Gardens              0   KKR    DC
..                                          ...            ...   ...   ...
811         Dubai International Cricket Stadium              0   RCB    MI
812         Dubai International Cricket Stadium              0    MI   KKR
813                        Sheikh Zayed Stadium              0   RCB   KKR
814                        Sheikh Zayed Stadium              0   KKR   KKR
815         Dubai International Cricket Stadium              0   KKR    MI

                     toss_winner toss_decision                       winner  \
0    Royal Challengers Bangalore         field        Kolkata Knight Riders
1            Chennai Super Kings           bat          Chennai Super Kings
2               Rajasthan Royals           bat             Delhi Daredevils
3                 Mumbai Indians           bat  Royal Challengers Bangalore
4                Deccan Chargers           bat        Kolkata Knight Riders
..                           ...           ...                          ...
811               Mumbai Indians         field  Royal Challengers Bangalore
812               Delhi Capitals         field               Mumbai Indians
813          Sunrisers Hyderabad         field          Sunrisers Hyderabad
814               Delhi Capitals           bat               Delhi Capitals
815               Delhi Capitals           bat               Mumbai Indians

      result  result_margin eliminator method      umpire1         umpire2
0       runs          140.0          N    NaN    Asad Rauf     RE Koertzen
1       runs           33.0          N    NaN    MR Benson      SL Shastri
2    wickets            9.0          N    NaN    Aleem Dar  GA Pratapkumar
3    wickets            5.0          N    NaN     SJ Davis       DJ Harper
4    wickets            5.0          N    NaN    BF Bowden     K Hariharan
..       ...            ...        ...    ...          ...             ...
811      tie            NaN          Y    NaN  Nitin Menon      PR Reiffel
812     runs           57.0          N    NaN  CB Gaffaney     Nitin Menon
813  wickets            6.0          N    NaN   PR Reiffel          S Ravi
814     runs           17.0          N    NaN   PR Reiffel          S Ravi
815  wickets            5.0          N    NaN  CB Gaffaney     Nitin Menon

[816 rows x 17 columns]

# NA values if we have certain empty data and we want to remove those columns we need to have na_value
## we just need to pass a array to whom it convert na_values

In [256]:
augTrainData = pd.read_csv('aug_train.csv',na_values = ['Female']); 
print(augTrainData); # it will convert all the male values into NaN

       enrollee_id      city  city_development_index gender  \
0             8949  city_103                   0.920   Male
1            29725   city_40                   0.776   Male
2            11561   city_21                   0.624    NaN
3            33241  city_115                   0.789    NaN
4              666  city_162                   0.767   Male
...            ...       ...                     ...    ...
19153         7386  city_173                   0.878   Male
19154        31398  city_103                   0.920   Male
19155        24576  city_103                   0.920   Male
19156         5756   city_65                   0.802   Male
19157        23834   city_67                   0.855    NaN

           relevent_experience enrolled_university education_level  \
0      Has relevent experience       no_enrollment        Graduate
1       No relevent experience       no_enrollment        Graduate
2       No relevent experience    Full time course        Graduate
3       No relevent experience                 NaN        Graduate
4      Has relevent experience       no_enrollment         Masters
...                        ...                 ...             ...
19153   No relevent experience       no_enrollment        Graduate
19154  Has relevent experience       no_enrollment        Graduate
19155  Has relevent experience       no_enrollment        Graduate
19156  Has relevent experience       no_enrollment     High School
19157   No relevent experience       no_enrollment  Primary School

      major_discipline experience company_size    company_type last_new_job  \
0                 STEM        >20          NaN             NaN            1
1                 STEM         15        50-99         Pvt Ltd           >4
2                 STEM          5          NaN             NaN        never
3      Business Degree         <1          NaN         Pvt Ltd        never
4                 STEM        >20        50-99  Funded Startup            4
...                ...        ...          ...             ...          ...
19153       Humanities         14          NaN             NaN            1
19154             STEM         14          NaN             NaN            4
19155             STEM        >20        50-99         Pvt Ltd            4
19156              NaN         <1      500-999         Pvt Ltd            2
19157              NaN          2          NaN             NaN            1

       training_hours  target
0                  36     1.0
1                  47     0.0
2                  83     0.0
3                  52     1.0
4                   8     0.0
...               ...     ...
19153              42     1.0
19154              52     1.0
19155              44     0.0
19156              97     0.0
19157             127     0.0

[19158 rows x 14 columns]

# Loading a huga data into chuncks
## we will have very large data and we can break those data into chunks

In [263]:
# it will take first 5000 data and so on
dfs = pd.read_csv('aug_train.csv',chunksize = 5000) ; 
for chunks in dfs:
    print(chunks.shape);

(5000, 14)
(5000, 14)
(5000, 14)
(4158, 14)